In [4]:
import pandas as pd

In [5]:
books = pd.read_csv(r"C:\Users\USER\Desktop\10Alytics\week 4 SQL\books_csv.csv")

In [6]:
books.head()

,BookID,Title,Author,Genre,PublishedDate,ISBN,CopiesAvailable
0,1,The FloralWhite Purpose number model air,Steven Kelly,Fantasy,2021-08-18,978-0-7507-0772-5,9
1,2,The Fuchsia Wide several pay education,Dr. Joanna Carter,Mystery,2017-08-28,978-1-83033-305-6,8
2,3,The Orchid Able suffer,William Escobar,Non-fiction,2020-09-08,978-1-972153-48-2,18
3,4,The LightPink Carry alone trade include,Sheryl Sullivan,Romance,2006-10-21,978-1-385-95042-5,14
4,5,The RosyBrown Senior material,Kristen Mcneil,Science Fiction,2015-06-12,978-1-57863-381-4,11

In [7]:
books.shape

(500, 7)

In [8]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   BookID           500 non-null    int64
 1   Title            500 non-null    object
 2   Author           500 non-null    object
 3   Genre            500 non-null    object
 4   PublishedDate    500 non-null    object
 5   ISBN             500 non-null    object
 6   CopiesAvailable  500 non-null    int64
dtypes: int64(2), object(5)
memory usage: 27.5+ KB

In [9]:
books['Genre'].value_counts()

Genre
Romance            83
Fantasy            79
Non-fiction        76
Thriller           73
Mystery            71
Historical         60
Science Fiction    58
Name: count, dtype: int64

In [10]:
loan = pd.read_csv(r"C:\Users\USER\Desktop\10Alytics\week 4 SQL\loans_csv.csv")

In [11]:
loan.head()

   LoanID  BookID  MemberID    LoanDate     DueDate  ReturnDate
0       1     438       126  2023-05-29  2023-06-12  2023-06-03
1       2     371       308  2023-04-20  2023-05-04  2023-04-27
2       3     340       128  2023-04-03  2023-04-17  2023-04-15
3       4     223       204  2023-08-31  2023-09-14  2023-09-06
4       7     328       178  2023-06-12  2023-06-26  2023-06-20

In [29]:
loan.shape

(685, 6)

In [12]:
loan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 685 entries, 0 to 684
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   LoanID      685 non-null    int64
 1   BookID      685 non-null    int64
 2   MemberID    685 non-null    int64
 3   LoanDate    685 non-null    object
 4   DueDate     685 non-null    object
 5   ReturnDate  685 non-null    object
dtypes: int64(3), object(3)
memory usage: 32.2+ KB

In [13]:
members = pd.read_csv(r"C:\Users\USER\Desktop\10Alytics\week 4 SQL\members_csv.csv")

In [14]:
members.head()

   MemberID  FirstName  LastName                        Email RegisteredDate
0         1      Larry   Garrett        markadams@example.net     2023-02-14
1         2       Mary    Parker  ferrelljennifer@example.org     2023-09-05
2         3      Brian    Dillon          james53@example.com     2023-03-26
3         4  Christina  Anderson     jacksonbilly@example.org     2023-06-03
4         5     Olivia    Parker          njensen@example.net     2023-06-03

In [15]:
members.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   MemberID        400 non-null    int64
 1   FirstName       400 non-null    object
 2   LastName        400 non-null    object
 3   Email           400 non-null    object
 4   RegisteredDate  400 non-null    object
dtypes: int64(1), object(4)
memory usage: 15.8+ KB